# BAIM 3220: Introduction to Python
## Quiz #7: Intro to Pandas
### The goal of this quiz is to show your understanding of the following concepts:
1. Use preliminary steps to understand your data: importing the pandas module and checking directory
2. Read data into a DataFrame or Series
3. Examine a DataFrame's basic structure
4. Extract specific data from a pandas DataFrame
5. Lastly, we revisit python fundamentals to keep those skills fresh

## After downloading this .ipynb file from Canvas, resave with the following naming format:
>- LastName_FirstName_Quiz7.ipynb

## When you are ready to submit your quiz, upload your .ipynb file to Canvas in Quiz#7

# Question Set 1: (28 points)
## The next set of questions use the `students100.xlsx` file
>- Download the `students100.xlsx` file from Canvas under the `Week 9` module

## Q1 (2 Points): Import Pandas and give it a alias as pd

In [1]:
import pandas as pd

## Q2: (2 points): Check your working directory

In [3]:
import os 

print(os.getcwd())

C:\Users\ATrain\Documents\BAIM 3220 Python\week_9

## Q3 (6 Points): Define pandas DataFrame 
>- (2) Assign the `student100.xlsx` data to a DataFrame object named, `student`
>- (2) Read the `students100.xlsx` 
>- (2) Set the index for the `student` DataFrame to the 'studentID' column

In [13]:
student = pd.DataFrame()

student = pd.read_excel('students100-1.xlsx', index_col = 0) #using -1 because I had to download from the module week_9 and that was the name

## Q4 (2 points): Show Sample Data
>- Show the first 7 rows of the `student` dataframe

In [14]:
student.head(7)

          firstName lastName  birthdate      Quiz1  Quiz2
studentID
1001            Amy   Willis 1991-10-23   4.140812     91
1002         Donald   Pierce 1990-04-07  61.519937    100
1003           Adam   Holmes 1991-05-16   9.836241     67
1004        Patrick    Payne 1990-12-29  66.732694     73
1005          Chris    Lynch 1990-10-03  31.576606     85
1006       Clarence   George 1988-04-29  62.222653     97
1007          James   Lawson 1989-10-17  42.533444     54

## Q5 (2 Points) Show what datatypes are in the dataframe
>- Note: this is a "look it up" question because we didn't cover this in class

In [16]:
student.dtypes

firstName            object
lastName             object
birthdate    datetime64[ns]
Quiz1               float64
Quiz2                 int64
dtype: object

## Q6 (2 Points) Show the number of records/rows in the dataset
>- Just the number of rows, nothing else
>- Assign a variable to this called, `totRecords`

In [19]:
totRecords = student.shape[0]

print(totRecords)

100

## Q7 (2 Points) Show the number of columns/fields in the dataset
>- Just the number of columns, nothing else

In [22]:
print(student.shape[1]) #doesn't include the index column

print(student.shape[1]+1) #includes the index column

5
6

## Q8 (2 Points) Show the `Quiz2` score of the student with the ID `1046`

In [29]:
student['Quiz2'][1046]

96

## Q9 (2 points) Show the `birthdate` of the student with the ID `1077`

In [30]:
student['birthdate'][1077]

Timestamp('1991-03-15 00:00:00')

## Q10 (2 Points) Show the third through the 10th records
>- Show all the fields/columns related to these records

In [32]:
student[2:10]

          firstName   lastName  birthdate      Quiz1  Quiz2
studentID
1003           Adam     Holmes 1991-05-16   9.836241     67
1004        Patrick      Payne 1990-12-29  66.732694     73
1005          Chris      Lynch 1990-10-03  31.576606     85
1006       Clarence     George 1988-04-29  62.222653     97
1007          James     Lawson 1989-10-17  42.533444     54
1008        Barbara  Robertson 1991-12-05  42.743908     64
1009          Louis    Simpson 1990-12-13  42.614158     77
1010         Dennis    Gilbert 1990-12-07  25.074897     74

## Q11 (2 Points) Show all rows for columns 2 to 4 (birthday-Quiz1)

In [57]:
student.iloc[:,2:4]

           birthdate      Quiz1
studentID
1001      1991-10-23   4.140812
1002      1990-04-07  61.519937
1003      1991-05-16   9.836241
1004      1990-12-29  66.732694
1005      1990-10-03  31.576606
...              ...        ...
1096      1991-11-05  81.978636
1097      1990-03-18  96.395876
1098      1988-12-23  91.205344
1099      1989-12-06  62.268194
1100      1990-11-17  17.970791

[100 rows x 2 columns]

## Q12 (2 Points) Show all data for studentID's from 1071-1076

In [74]:
student.loc[1071:1076]

          firstName   lastName  birthdate      Quiz1  Quiz2
studentID
1071          Kevin   Campbell 1991-09-28  85.034625     94
1072         Samuel    Elliott 1990-11-22  80.385630     59
1073          Annie  Hernandez 1989-11-15  83.166151     93
1074         Willie      Evans 1991-09-04  74.886973     98
1075          Norma      Lynch 1991-12-02  89.951541     98
1076          Jason    Freeman 1989-06-01  27.757535     82

# Question Set 2: Python Fundamentals

## Q15 (40 Points) Write a program that allows or denies access based on a given list of approved users

### Your program should follow the below specifications

>- Your program should prompt the user to enter a login with "What is your login?"
>- If the input is in the allowed users list your program should print "Access granted"
>- If the input is not in the allowed users list your program should print "Access denied, try again"
>- Allow the program to continue for up to 5 user attempts at the login
>>- After 5 unsuccessful attempts print to the screen: "Too many attempts, the account is locked."
>- Your program should be case `insensitive`
>- The following code cell gives the allowed user list.

In [65]:
allowed_users = ['admin','micah', 'kadence','karina','jack','david']

In [76]:


count = 0
while count < 5:
    user = input('What is your login?')
    
    if user in allowed_users:
        print('Access granted')
        break
    
    else:
        count +=1 
        
        if count < 5:
                print('Access denied, try again')
        
        elif count == 5:
            print('Too many attempts, the account is locked.')
            break

What is your login?dsfg
Access denied, try again
What is your login?dfg
Access denied, try again
What is your login?sdfg
Access denied, try again
What is your login?sdfg
Access denied, try again
What is your login?sdfg
Too many attempts, the account is locked.